eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСРЖД/абс_ПоступлениеОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПоступлениеОСРЖД</name>
  <basedOn>Document.ПринятиеКУчетуОС</basedOn>
  <basedOn>Document.МодернизацияОС</basedOn>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСРЖД</registerRecords>
  <registerRecords>AccountingRegister.абс_МеждународныйОСРЖД</registerRecords>
  <registerRecords>InformationRegister.абс_ОсновныеСредстваРЖД</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестонахождениеОбъекта</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленнойАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправедливаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УбытокОтОбесценения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНачисленияАмортизации</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодНачисленияАмортизации</name>
      <type>
        <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредполагаемыйОбъемПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/абс_МеждународныйОСРЖД/абс_МеждународныйОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>абс_МеждународныйОСРЖД</name>
  <chartOfAccounts>ChartOfAccounts.абс_МеждународныйОСРЖД</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.абс_МеждународныйОСРЖД.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОсновныеСредстваРЖД/абс_ОсновныеСредстваРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОсновныеСредстваРЖД</name>
  <comment>(Упр) Сведения об объектах ОС  для целей РЖД</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный РЖД</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСРЖД/абс_СтоимостьОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСРЖД</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет/НачислениеАмортизацииОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НачислениеАмортизацииОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСРЖД/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
// Обработчики событий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПоступлениеОСРЖДПоПринятиюКУчетуОС(ДанныеЗаполнения);
	ИначеЕсли  ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.МодернизацияОС") Тогда 
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПоступлениеОСРЖДПоМодернизацииОС(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПоступлениеОСРЖДПоВводуНачальныхОстатковОС(ДанныеЗаполнения);
	КонецЕсли;	
	//СтандартнаяОбработка = Ложь;
	//ЗаполнитьПоДокументуОснования(ДанныеЗаполнения);
	//
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если Не ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Номер) Тогда
		УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		абс_ПроведениеДокументов.УдалитьДвиженияРегистратора(Ссылка);
	КонецЕсли;
	
	Движения.абс_МеждународныйОСРЖД.Записывать = Истина;
	Движения.абс_ОсновныеСредстваРЖД.Записывать = Истина;
	Движения.абс_СтоимостьОСРЖД.Записывать = Истина;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата);
	
	ТипДокументаОснования = ТипЗнч(ДокументОснование);
	
	СтруктураЗапросов = Документы.абс_ПоступлениеОСРЖД.ПолучитьСтруктуруЗапросовПроведения(ТипДокументаОснования);
	
	ПустыеСубконто = ПолучитьПустыеСубконто();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", НачалоПериода);
	Запрос.УстановитьПараметр("ПустыеСубконто", ПустыеСубконто);
	
	ТекстыЗапросов = Новый СписокЗначений;
	ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_МеждународныйУчетОСРЖД_ТекстЗапросаВидыСубконтоСчетов, "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_МеждународныйУчетОСРЖД_ТекстЗапросаСоответствиеСчетовХозрасчетныйРЖД, "");
	
	Запрос.Текст = "";
	Для Каждого ЭлементСписка Из ТекстыЗапросов Цикл
		Запрос.Текст = Запрос.Текст+ЭлементСписка.Значение;
	КонецЦикла;
	
	Запрос.ВыполнитьПакет();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	Запрос.УстановитьПараметр("МоментДокументаДляРН", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстыЗапросов = Новый СписокЗначений;
	
	СчетаУчетаБУ = Новый Массив;
	СчетаУчетаБУ.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	СчетаУчетаБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("МоментОснования", ДокументОснование.МоментВремени());
	Запрос.УстановитьПараметр("СчетаУчетаБУ", СчетаУчетаБУ);
	
	Если ТипДокументаОснования=Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
		
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Принятие_ТекстЗапросаДанныеШапкиОснования , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Принятие_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Принятие_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		
	ИначеЕсли ТипДокументаОснования=Тип("ДокументСсылка.МодернизацияОС") Тогда
		
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Модернизация_ТекстЗапросаОсновныеСредстваОснования , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Модернизация_ТекстЗапросаПараметрыОсновныхСредствОснования , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Модернизация_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти , "");
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Модернизация_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		
	ИначеЕсли ТипДокументаОснования=Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда
		
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Остатки_ТекстЗапросаТабличнаяЧастьОсновныеСредства , "");
		
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаСтоимостьОсновныхСредствДоДокумента , "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС , "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаНоваяСтоимостьОсновныхСредств , "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаИзменениеПараметровОсновныхСредств , "");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД , "Таблица_абс_СтоимостьОСРЖД");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД , "Таблица_абс_ОсновныеСредстваРЖД");
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД , "Таблица_абс_МеждународныйОСРЖД");
	Если ТипДокументаОснования=Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Принятие_УдалениеВременныхТаблиц, "");
	ИначеЕсли ТипДокументаОснования=Тип("ДокументСсылка.МодернизацияОС") Тогда
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Модернизация_УдалениеВременныхТаблиц, "");
	ИначеЕсли ТипДокументаОснования=Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда
		ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_Остатки_УдалениеВременныхТаблиц, "");
	КонецЕсли;
	ТекстыЗапросов.Добавить(СтруктураЗапросов.Поступление_УдалениеВременныхТаблиц, "");
	
	
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса Из ТекстыЗапросов Цикл
		Запрос.Текст = Запрос.Текст+ТекстЗапроса.Значение;
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДанных = Новый Структура;
	
	Для Каждого ТекстЗапроса Из ТекстыЗапросов Цикл
		
		ИмяТаблицы = ТекстЗапроса.Представление;
		
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапросов.Индекс(ТекстЗапроса);
			ТаблицыДанных.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_ОсновныеСредстваРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_ОсновныеСредстваРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_ОсновныеСредстваРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_СтоимостьОСРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_СтоимостьОСРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_СтоимостьОСРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("Таблица_абс_МеждународныйОСРЖД") Тогда
		
		ТаблицаРегистра = ТаблицыДанных.Таблица_абс_МеждународныйОСРЖД;
		Если ТаблицаРегистра.Количество()>0 Тогда
			
			НаборЗаписей = Движения.абс_МеждународныйОСРЖД;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//абс_ПроведениеДокументов.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	//Документы.абс_ПоступлениеОСРЖД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	
	
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//абс_ПроведениеДокументов.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект, ДополнительныеСвойства.ЭтоНовый);
	//
	//абс_ВнеоборотныеАктивы.Отразить_абс_ОсновныеСредстваРЖД(ДополнительныеСвойства, Движения, Отказ);
	//абс_ВнеоборотныеАктивы.Отразить_абс_СтоимостьОСРЖД(ДополнительныеСвойства, Движения, Отказ);
	//абс_МеждународныйУчетОСРЖД.Отразить_абс_МеждународныйОСРЖД(ДополнительныеСвойства, Движения, Отказ);
	//
	//абс_ПроведениеДокументов.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
// Обработка заполнения

Процедура ЗаполнитьПоступлениеОСРЖДПоПринятиюКУчетуОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
	
	Для Каждого СтрокаОС Из ДокОснование.ОсновныеСредства Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		СтрокаТЧ.МОЛ = ДокОснование.МОЛБУ;
		СтрокаТЧ.МестонахождениеОбъекта = ДокОснование.ПодразделениеОрганизации;
		СтрокаТЧ.КоэффициентУскорения = ДокОснование.КоэффициентУскоренияБУ;
		Если СтрокаТЧ.КоэффициентУскорения=0 Тогда
			СтрокаТЧ.КоэффициентУскорения = 1;
		КонецЕсли;
		СтрокаТЧ.НачислятьАмортизацию = ДокОснование.НачислятьАмортизациюБУ;
		СтрокаТЧ.ДатаПринятияКУчету = ДокОснование.Дата;
		СтрокаТЧ.СчетСниженияСтоимости = ПланыСчетов.абс_МеждународныйОСРЖД.Служебный;
		Способ = ДокОснование.СпособыОтраженияРасходовПоАмортизации.Способы[0];
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.абс_МеждународныйОСРЖД.НайтиПоКоду("Р"+Способ.СчетЗатрат.Код);
		СтрокаТЧ.Субконто1 = Способ.Субконто1;
		СтрокаТЧ.Субконто2 = Способ.Субконто2;
		СтрокаТЧ.Субконто3 = Способ.Субконто3;
		ВидыСубконто = СтрокаТЧ.СчетЗатрат.ВидыСубконто;
		КоличествоСубконто = ВидыСубконто.Количество();
		Для Сч = 1 По КоличествоСубконто Цикл
			Если СтрокаТЧ["Субконто"+Сч]=Неопределено Или Не ЗначениеЗаполнено(СтрокаТЧ["Субконто"+Сч]) Тогда
				Если ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.СтатьяЗатрат;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.НоменклатурнаяГруппа;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.ПодразделениеОрганизации;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьПоступлениеОСРЖДПоМодернизацииОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
	
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		
		ДанныеРегистра = РегистрыСведений.МестонахождениеОСБухгалтерскийУчет.ПолучитьПоследнее(ДокОснование.Дата, Новый Структура("ОсновноеСредство, Организация", СтрокаОС.ОсновноеСредство, ДокОснование.Организация));
		СтрокаТЧ.МОЛ = ДанныеРегистра.МОЛ;
		СтрокаТЧ.МестонахождениеОбъекта = ДанныеРегистра.Местонахождение;
		СтрокаТЧ.КоэффициентУскорения = СтрокаОС.КоэффициентУскоренияБУ;
		Если СтрокаТЧ.КоэффициентУскорения=0 Тогда
			СтрокаТЧ.КоэффициентУскорения = 1;
		КонецЕсли;
		
		ДанныеРегистра = РегистрыСведений.НачислениеАмортизацииОСБухгалтерскийУчет.ПолучитьПоследнее(ДокОснование.Дата, Новый Структура("ОсновноеСредство, Организация", СтрокаОС.ОсновноеСредство, ДокОснование.Организация));
		СтрокаТЧ.НачислятьАмортизацию = ДанныеРегистра.НачислятьАмортизацию;
		
		СтрокаТЧ.ДатаПринятияКУчету = ДокОснование.Дата;
		СтрокаТЧ.СчетСниженияСтоимости = ПланыСчетов.абс_МеждународныйОСРЖД.Служебный;
		
		ДанныеРегистра = РегистрыСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ПолучитьПоследнее(ДокОснование.Дата, Новый Структура("ОсновноеСредство, Организация", СтрокаОС.ОсновноеСредство, ДокОснование.Организация));
		Если ДанныеРегистра.СпособыОтраженияРасходовПоАмортизации.Пустая() Тогда 
			ДанныеРегистра = РегистрыСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("ОсновноеСредство, Организация", СтрокаОС.ОсновноеСредство, ДокОснование.Организация));
		КонецЕсли;	
		Способ = ДанныеРегистра.СпособыОтраженияРасходовПоАмортизации.Способы[0];
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.абс_МеждународныйОСРЖД.НайтиПоКоду("Р"+Способ.СчетЗатрат.Код);
		СтрокаТЧ.Субконто1 = Способ.Субконто1;
		СтрокаТЧ.Субконто2 = Способ.Субконто2;
		СтрокаТЧ.Субконто3 = Способ.Субконто3;
		ВидыСубконто = СтрокаТЧ.СчетЗатрат.ВидыСубконто;
		КоличествоСубконто = ВидыСубконто.Количество();
		Для Сч = 1 По КоличествоСубконто Цикл
			Если СтрокаТЧ["Субконто"+Сч]=Неопределено Или Не ЗначениеЗаполнено(СтрокаТЧ["Субконто"+Сч]) Тогда
				Если ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.СтатьяЗатрат;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.НоменклатурнаяГруппа;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.ПодразделениеОрганизации;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьПоступлениеОСРЖДПоВводуНачальныхОстатковОС(ДанныеЗаполнения)
	
	ДокОснование = ДанныеЗаполнения.ПолучитьОбъект();
	ЗаполнитьШапкуИОчиститьТЧ(ДокОснование);
	
	Для Каждого СтрокаОС Из ДокОснование.ОС Цикл
		
		СтрокаТЧ = ОсновныеСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
		СтрокаТЧ.МОЛ = СтрокаОС.МОЛРегл;
		СтрокаТЧ.МестонахождениеОбъекта = ДокОснование.ПодразделениеОрганизации;
		СтрокаТЧ.КоэффициентУскорения = СтрокаОС.КоэффициентУскоренияБУ;
		Если СтрокаТЧ.КоэффициентУскорения=0 Тогда
			СтрокаТЧ.КоэффициентУскорения = 1;
		КонецЕсли;
		СтрокаТЧ.НачислятьАмортизацию = СтрокаОС.НачислятьАмортизациюБУ;
		СтрокаТЧ.ДатаПринятияКУчету = СтрокаОС.ДатаПринятияКУчету;
		СтрокаТЧ.СчетСниженияСтоимости = ПланыСчетов.абс_МеждународныйОСРЖД.Служебный;
		Способ = СтрокаОС.СпособОтраженияРасходовПоАмортизацииБУ.Способы[0];
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.абс_МеждународныйОСРЖД.НайтиПоКоду("Р"+Способ.СчетЗатрат.Код);
		СтрокаТЧ.Субконто1 = Способ.Субконто1;
		СтрокаТЧ.Субконто2 = Способ.Субконто2;
		СтрокаТЧ.Субконто3 = Способ.Субконто3;
		ВидыСубконто = СтрокаТЧ.СчетЗатрат.ВидыСубконто;
		КоличествоСубконто = ВидыСубконто.Количество();
		Для Сч = 1 По КоличествоСубконто Цикл
			Если СтрокаТЧ["Субконто"+Сч]=Неопределено Или Не ЗначениеЗаполнено(СтрокаТЧ["Субконто"+Сч]) Тогда
				Если ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.СтатьяЗатрат;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.НоменклатурнаяГруппа;
				ИначеЕсли ВидыСубконто[Сч-1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда
					СтрокаТЧ["Субконто"+Сч] = Способ.ПодразделениеОрганизации;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьШапкуИОчиститьТЧ(ДокОснование)
	
	Дата = ДокОснование.Дата;
	Организация = ДокОснование.Организация;
	ДокументОснование = ДокОснование.Ссылка;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Если Номер = "" Тогда
		УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли;
	
	ОсновныеСредства.Очистить();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции

Функция ПолучитьПустыеСубконто()

	ПустыеСубконто = Новый СписокЗначений;
	ВыборкаСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Выбрать();
	Пока ВыборкаСубконто.Следующий() Цикл
		ПустыеСубконто.Добавить(ВыборкаСубконто.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	ПустыеСубконто.Добавить(Неопределено);
	
	Возврат ПустыеСубконто;

КонецФункции // ПолучитьПустыеСубконто()


























//////////////////////////////////////////////////////////////////////////////////
// Процедуры заполнения по документам-основаниям

Процедура ЗаполнитьПоДокументуОснования(ДанныеЗаполнения)
	
	ТаблицыДанных = Новый Структура;
	
	СчетаУчетаБУ = Новый Массив;
	СчетаУчетаБУ.Добавить(ПланыСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации);
	
	СчетаАмортизацииБУ = Новый Массив;
	СчетаАмортизацииБУ.Добавить(ПланыСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ПериодОснования", ДанныеЗаполнения.Дата);
	Запрос.УстановитьПараметр("Организация", ДанныеЗаполнения.Организация);
	Запрос.УстановитьПараметр("СчетаУчетаБУ", СчетаУчетаБУ);
	Запрос.УстановитьПараметр("СчетаАмортизацииБУ", СчетаАмортизацииБУ);
	Запрос.УстановитьПараметр("ПустыеСубконто", абс_МеждународныйУчетОСРЖД.ПолучитьСписокПустыхСубконто(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные));
	
	ТекстыЗапросов = Новый СписокЗначений;
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("ПериодОснования", "ПустыеСубконто", "СоответствиеСчетовХозрасчетныйМеждународный"), "");
	ТекстыЗапросов.Добавить(абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаШапкаОснования(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаПоступившиеОсновныеСредстваОснования(), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "ПериодОснования", "ПараметрыОсновныхСредств"), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_МестонахождениеОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "МестонахождениеОСБУ"), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_НачислениеАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "НачислениеАмортизацииБУ"), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ПараметрыАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "ПараметрыАмортизацииОСБУ"), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "СпособыОтраженияРасходовПоАмортизацииБУ"), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_СчетаБухгалтерскогоУчетаОСПоТаблицеОС("ПоступившиеОсновныеСредстваОснования", "Организация", "ПериодОснования", "СчетаУчетаБУ"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаШапка(), "ТаблицаШапка");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаОсновныеСредства(), "ТаблицаОсновныеСредства");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ТаблицыДанных);
	
	Если ТаблицыДанных.Свойство("ТаблицаШапка") И ТаблицыДанных.ТаблицаШапка.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТаблицыДанных.ТаблицаШапка[0]);
	КонецЕсли;
	
	Если ТаблицыДанных.Свойство("ТаблицаОсновныеСредства") Тогда
		ОсновныеСредства.Загрузить(ТаблицыДанных.ТаблицаОсновныеСредства);
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// Функции текстов запросов для процедур заполнения

Функция ТекстЗапросаШапкаОснования()
	
	Возврат "ВЫБРАТЬ
	        |	ПринятиеКУчетуОС.Ссылка КАК ДокументОснование,
	        |	ПринятиеКУчетуОС.Дата,
	        |	ПринятиеКУчетуОС.Организация,
	        |	ПринятиеКУчетуОС.ПодразделениеОрганизации КАК Местонахождение
	        |ПОМЕСТИТЬ ШапкаОснования
	        |ИЗ
	        |	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	        |ГДЕ
	        |	ПринятиеКУчетуОС.Ссылка = &ДокументОснование
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаПоступившиеОсновныеСредстваОснования()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	        |	СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	        |	СУММА(ВложенныйЗапрос.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	        |	ВложенныйЗапрос.КоррСчет,
	        |	ВложенныйЗапрос.КоррСубконто1,
	        |	ВложенныйЗапрос.КоррСубконто2,
	        |	ВложенныйЗапрос.КоррСубконто3
	        |ПОМЕСТИТЬ ПоступившиеОсновныеСредстваОснования
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	        |		ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
	        |		0 КАК СуммаНачисленнойАмортизации,
	        |		ХозрасчетныйДвиженияССубконто.СчетКт КАК КоррСчет,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК КоррСубконто1,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК КоррСубконто2,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК КоррСубконто3
	        |	ИЗ
	        |		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	        |				,
	        |				,
	        |				Период = &ПериодОснования
	        |					И Регистратор = &ДокументОснование
	        |					И СчетДт В ИЕРАРХИИ (&СчетаУчетаБУ),
	        |				,
	        |				) КАК ХозрасчетныйДвиженияССубконто
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК Справочник.ОсновныеСредства),
	        |		0,
	        |		ХозрасчетныйДвиженияССубконто.Сумма,
	        |		ХозрасчетныйДвиженияССубконто.СчетДт,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт1,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт2,
	        |		ХозрасчетныйДвиженияССубконто.СубконтоДт3
	        |	ИЗ
	        |		РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	        |				,
	        |				,
	        |				Период = &ПериодОснования
	        |					И Регистратор = &ДокументОснование
	        |					И СчетКт В ИЕРАРХИИ (&СчетаАмортизацииБУ),
	        |				,
	        |				) КАК ХозрасчетныйДвиженияССубконто) КАК ВложенныйЗапрос
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.ОсновноеСредство,
	        |	ВложенныйЗапрос.КоррСчет,
	        |	ВложенныйЗапрос.КоррСубконто1,
	        |	ВложенныйЗапрос.КоррСубконто2,
	        |	ВложенныйЗапрос.КоррСубконто3
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблицаШапка()
	
	Возврат "ВЫБРАТЬ
	        |	ШапкаОснования.ДокументОснование,
	        |	ШапкаОснования.Дата,
	        |	ШапкаОснования.Организация
	        |ИЗ
	        |	ШапкаОснования КАК ШапкаОснования
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблицаОсновныеСредства()
	
	Возврат "ВЫБРАТЬ
	        |	ПоступившиеОсновныеСредстваОснования.ОсновноеСредство КАК ОсновноеСредство,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.ДатаПринятияКУчету, ЕСТЬNULL(СостоянияОСОрганизаций.ДатаСостояния, &ПериодОснования)) КАК ДатаПринятияКУчету,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МестонахождениеОбъекта, ЕСТЬNULL(МестонахождениеОСБУ.Местонахождение, ШапкаОснования.Местонахождение)) КАК Местонахождение,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МОЛ, ЕСТЬNULL(МестонахождениеОСБУ.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))) КАК МОЛ,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СрокПолезногоИспользования, ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования, 0)) КАК СрокПолезногоИспользования,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.КоэффициентУскорения, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.КоэффициентУскорения, 1)) КАК КоэффициентУскорения,
	        |	ПоступившиеОсновныеСредстваОснования.Стоимость,
	        |	ПоступившиеОсновныеСредстваОснования.СуммаНачисленнойАмортизации,
	        |	ПоступившиеОсновныеСредстваОснования.Стоимость КАК СправедливаяСтоимость,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость ЕСТЬ NULL 
	        |			ТОГДА ВЫРАЗИТЬ(ПоступившиеОсновныеСредстваОснования.Стоимость * ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.ПроцентЛиквидационнойСтоимости, 0) / 100 КАК ЧИСЛО(15, 2))
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ЛиквидационнаяСтоимость,
	        |	0 КАК УбытокОтОбесценения,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетУчета, ЕСТЬNULL(СчетаУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации))) КАК СчетУчета,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетНачисленияАмортизации, ЕСТЬNULL(СчетаАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01))) КАК СчетНачисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетЗатрат, ЕСТЬNULL(СчетаЗатрат.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ПустаяСсылка))) КАК СчетЗатрат,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто1 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто1
	        |	КОНЕЦ КАК Субконто1,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто2 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто2
	        |	КОНЕЦ КАК Субконто2,
	        |	ВЫБОР
	        |		КОГДА ПараметрыОсновныхСредств.Субконто3 ЕСТЬ NULL 
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 ЕСТЬ NULL 
	        |							ИЛИ ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	        |						ТОГДА НЕОПРЕДЕЛЕНО
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СпособыСтроительства)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Продукция
	        |					КОГДА ВидыСубконтоСчетовЗатрат.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыДеятельности)
	        |						ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |					ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
	        |				КОНЕЦ
	        |		ИНАЧЕ ПараметрыОсновныхСредств.Субконто3
	        |	КОНЕЦ КАК Субконто3,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.СчетСниженияСтоимости, ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный)) КАК СчетСниженияСтоимости,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.НачислятьАмортизацию, ЕСТЬNULL(НачислениеАмортизацииБУ.НачислятьАмортизацию, ИСТИНА)) КАК НачислятьАмортизацию,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный)) КАК МетодНачисленияАмортизации,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции, ЕСТЬNULL(ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации, 0)) КАК ПредполагаемыйОбъемПродукции,
	        |	ЕСТЬNULL(ПараметрыОсновныхСредств.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)) КАК Состояние,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСчет,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто1,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто2,
	        |	ПоступившиеОсновныеСредстваОснования.КоррСубконто3
	        |ИЗ
	        |	ПоступившиеОсновныеСредстваОснования КАК ПоступившиеОсновныеСредстваОснования
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБУ КАК МестонахождениеОСБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = МестонахождениеОСБУ.Местонахождение
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовПоАмортизацииБУ КАК СпособыОтраженияРасходовПоАмортизацииБУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
	        |				ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаЗатрат
	        |					ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетовЗатрат
	        |					ПО СчетаЗатрат.СчетМеждународный = ВидыСубконтоСчетовЗатрат.Счет
	        |				ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СчетаЗатрат.СчетХозрасчетный
	        |					И (СчетаЗатрат.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
	        |			ПО СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
	        |				И (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК КоррСчета
	        |		ПО ПоступившиеОсновныеСредстваОснования.КоррСчет = КоррСчета.СчетХозрасчетный
	        |		ЛЕВОЕ СОЕДИНЕНИЕ НачислениеАмортизацииБУ КАК НачислениеАмортизацииБУ
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = НачислениеАмортизацииБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство
	        |			И (СостоянияОСОрганизаций.Организация = &Организация)
	        |			И (СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаУчетаБУ КАК СчетаУчетаБУ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаУчета
	        |			ПО СчетаУчетаБУ.СчетУчета = СчетаУчета.СчетХозрасчетный
	        |				И (СчетаУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
	        |			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМеждународный КАК СчетаАмортизации
	        |			ПО СчетаУчетаБУ.СчетНачисленияАмортизации = СчетаАмортизации.СчетХозрасчетный
	        |				И (СчетаАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство = СчетаУчетаБУ.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
	        |		ПО ПоступившиеОсновныеСредстваОснования.ОсновноеСредство.КодПоОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
	        |			И ПоступившиеОсновныеСредстваОснования.ОсновноеСредство.абс_ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД,
	        |	ШапкаОснования КАК ШапкаОснования
			|;
			|";
	
КонецФункции
